import { dataAnswerRuleC1Part1, dataAnswerRuleC1Part2 } from "./dataToGenerateTopicsC1"

export const generateModelAnswerC1Part1 = (topicTask: string, topicId: string) => {
    return `
        Ты — опытный составитель экзаменов Goethe-Institut (уровень C1), работаешь строго по модульному формату 2024. 
        Ранее ты сгенерировал следюущее задание: ${topicTask}
        ТВОЯ ЗАДАЧА: Сгенерируй пример идеального ответа на задание выше.
        Детальное описание формата ответа Teil 1: ${dataAnswerRuleC1Part1}
        
        ФОРМАТ ВЫВОДА (строго): 
        Сгенерированный ответ выводи в формате JSON, который представлен ниже. Не меняй поле topicId.
        {
            "topicId": "${topicId}",
            "content": "сгенерированный ответ",
            "wordCount": "количество слов в ответе",
            "highlights": {
                "greeting": "приветствие в начале ответа",
                "mainPoints": ["основные моменты в ответе"],
                "closing": "закрытие в конце ответа",
                "keyPhrases": ["ключевые фразы в ответе"]
            }
        }

        topicId - id задания, к которому ты составляешь ответ 
        content - сгенерированный "идеальный" ответ 
        highlights - здесь укажи основные моменты почему твой сгенерированный ответ является идеальным

        Важное: ответы должны быть реалистичными и современными. 
    `
}

export const generateModelAnswerC1Part2 = (topicTask: string, topicId: string) => {
    return `
        Ты — опытный составитель экзаменов Goethe-Institut (уровень C1), работаешь строго по модульному формату 2024. 
        Ранее ты сгенерировал следюущее задание: ${topicTask}
        ТВОЯ ЗАДАЧА: Сгенерируй пример идеального ответа на задание выше.
        Детальное описание формата ответа Teil 2: ${dataAnswerRuleC1Part2}
        
        ФОРМАТ ВЫВОДА (строго): 
        Сгенерированный ответ выводи в формате JSON, который представлен ниже. Не меняй поле topicId.
        {
            "topicId": "${topicId}",
            "content": "сгенерированный ответ",
            "wordCount": "количество слов в ответе",
            "highlights": {
                "greeting": "приветствие в начале ответа",
                "mainPoints": ["основные моменты в ответе"],
                "closing": "закрытие в конце ответа",
                "keyPhrases": ["ключевые фразы в ответе"]
            }
        }

        topicId - id задания, к которому ты составляешь ответ 
        content - сгенерированный "идеальный" ответ 
        highlights - здесь укажи основные моменты почему твой сгенерированный ответ является идеальным

        Важное: ответы должны быть реалистичными и современными. 
    `
}